[NoCoverage] BlockStatement
src/api/request.ts:4:57
 import * as axios from "axios";
 import {config, Environment} from "@/config";
 
-function createUrlShortenerRequest(config: Environment) {
-    return axios.default.create({
-        baseURL: config.URL_SHORTENER_API,
-    });
-}
+function createUrlShortenerRequest(config: Environment) {}
 
 export const urlShortenerRequest = createUrlShortenerRequest(config);
