[NoCoverage] ArrowFunction
src/App.tsx:4:13
 import './App.css'
 import {GuestShortenUrlForm} from "@/urls/GuestShortenUrlForm.tsx";
 
-const App = () => (
-    <>
-        <GuestShortenUrlForm/>
-    </>
-);
+const App = () => undefined;
 
 export default App
