[Killed] BlockStatement
src/components/ui/form.tsx:34:45
   TName extends FieldPath<TFieldValues> = FieldPath<TFieldValues>
 >({
   ...props
-}: ControllerProps<TFieldValues, TName>) => {
-  return (
-    <FormFieldContext.Provider value={{ name: props.name }}>
-      <Controller {...props} />
-    </FormFieldContext.Provider>
-  )
-}
+}: ControllerProps<TFieldValues, TName>) => {}
 
 const useFormField = () => {
killedBy: GuestShortenUrlForm should submit the form with the given URL
statusReason: Unable to find a label with the text of: /URL to shorten/i

Ignored nodes: comments, script, style
<body>
  <div>
    <form>
      <button

[Survived] ObjectLiteral
src/components/ui/form.tsx:36:39
   ...props
 }: ControllerProps<TFieldValues, TName>) => {
   return (
-    <FormFieldContext.Provider value={{ name: props.name }}>
+    <FormFieldContext.Provider value={{}}>
       <Controller {...props} />
     </FormFieldContext.Provider>

[Killed] BlockStatement
src/components/ui/form.tsx:42:28
   )
 }
 
-const useFormField = () => {
-  const fieldContext = React.useContext(FormFieldContext)
-  const itemContext = React.useContext(FormItemContext)
-  const { getFieldState, formState } = useFormContext()
-
-  const fieldState = getFieldState(fieldContext.name, formState)
-
-  if (!fieldContext) {
-    throw new Error("useFormField should be used within <FormField>")
-  }
-
-  const { id } = itemContext
-
-  return {
-    id,
-    name: fieldContext.name,
-    formItemId: `${id}-form-item`,
-    formDescriptionId: `${id}-form-item-description`,
-    formMessageId: `${id}-form-item-message`,
-    ...fieldState,
-  }
-}
+const useFormField = () => {}
 
 type FormItemContextValue = {
killedBy: GuestShortenUrlForm should submit the form with the given URL
statusReason: Cannot destructure property 'error' of 'useFormField(...)' as it is undefined.

[Killed] BooleanLiteral
src/components/ui/form.tsx:49:7
 
   const fieldState = getFieldState(fieldContext.name, formState)
 
-  if (!fieldContext) {
+  if (fieldContext) {
     throw new Error("useFormField should be used within <FormField>")
   }
killedBy: GuestShortenUrlForm should submit the form with the given URL
statusReason: useFormField should be used within <FormField>

[Killed] ConditionalExpression
src/components/ui/form.tsx:49:7
 
   const fieldState = getFieldState(fieldContext.name, formState)
 
-  if (!fieldContext) {
+  if (true) {
     throw new Error("useFormField should be used within <FormField>")
   }
killedBy: GuestShortenUrlForm should submit the form with the given URL
statusReason: useFormField should be used within <FormField>

[Killed] BlockStatement
src/components/ui/form.tsx:76:37
 const FormItem = React.forwardRef<
   HTMLDivElement,
   React.HTMLAttributes<HTMLDivElement>
->(({ className, ...props }, ref) => {
-  const id = React.useId()
-
-  return (
-    <FormItemContext.Provider value={{ id }}>
-      <div ref={ref} className={cn("space-y-2", className)} {...props} />
-    </FormItemContext.Provider>
-  )
-})
+>(({ className, ...props }, ref) => {})
 FormItem.displayName = "FormItem"
 
killedBy: GuestShortenUrlForm should submit the form with the given URL
statusReason: Unable to find a label with the text of: /URL to shorten/i

Ignored nodes: comments, script, style
<body>
  <div>
    <form>
      <button

[Survived] ObjectLiteral
src/components/ui/form.tsx:80:38
   const id = React.useId()
 
   return (
-    <FormItemContext.Provider value={{ id }}>
+    <FormItemContext.Provider value={{}}>
       <div ref={ref} className={cn("space-y-2", className)} {...props} />
     </FormItemContext.Provider>

[Survived] StringLiteral
src/components/ui/form.tsx:81:36
 
   return (
     <FormItemContext.Provider value={{ id }}>
-      <div ref={ref} className={cn("space-y-2", className)} {...props} />
+      <div ref={ref} className={cn("", className)} {...props} />
     </FormItemContext.Provider>
   )

[Killed] BlockStatement
src/components/ui/form.tsx:90:37
 const FormLabel = React.forwardRef<
   React.ElementRef<typeof LabelPrimitive.Root>,
   React.ComponentPropsWithoutRef<typeof LabelPrimitive.Root>
->(({ className, ...props }, ref) => {
-  const { error, formItemId } = useFormField()
-
-  return (
-    <Label
-      ref={ref}
-      className={cn(error && "text-destructive", className)}
-      htmlFor={formItemId}
-      {...props}
-    />
-  )
-})
+>(({ className, ...props }, ref) => {})
 FormLabel.displayName = "FormLabel"
 
killedBy: GuestShortenUrlForm should submit the form with the given URL
statusReason: Unable to find a label with the text of: /URL to shorten/i

Ignored nodes: comments, script, style
<body>
  <div>
    <form>
      <div
        class="space-y-2"

[Survived] ConditionalExpression
src/components/ui/form.tsx:96:21
   return (
     <Label
       ref={ref}
-      className={cn(error && "text-destructive", className)}
+      className={cn(false, className)}
       htmlFor={formItemId}
       {...props}

[Survived] ConditionalExpression
src/components/ui/form.tsx:96:21
   return (
     <Label
       ref={ref}
-      className={cn(error && "text-destructive", className)}
+      className={cn(true, className)}
       htmlFor={formItemId}
       {...props}

[Killed] BlockStatement
src/components/ui/form.tsx:107:26
 const FormControl = React.forwardRef<
   React.ElementRef<typeof Slot>,
   React.ComponentPropsWithoutRef<typeof Slot>
->(({ ...props }, ref) => {
-  const { error, formItemId, formDescriptionId, formMessageId } = useFormField()
-
-  return (
-    <Slot
-      ref={ref}
-      id={formItemId}
-      aria-describedby={
-        !error
-          ? `${formDescriptionId}`
-          : `${formDescriptionId} ${formMessageId}`
-      }
-      aria-invalid={!!error}
-      {...props}
-    />
-  )
-})
+>(({ ...props }, ref) => {})
 FormControl.displayName = "FormControl"
 
killedBy: GuestShortenUrlForm should submit the form with the given URL
statusReason: Found a label with the text of: /URL to shorten/i, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <form>
      <div
        class="space-y-2"

[Survived] BooleanLiteral
src/components/ui/form.tsx:115:9
       ref={ref}
       id={formItemId}
       aria-describedby={
-        !error
+        error
           ? `${formDescriptionId}`
           : `${formDescriptionId} ${formMessageId}`

[NoCoverage] StringLiteral
src/components/ui/form.tsx:117:13
       aria-describedby={
         !error
           ? `${formDescriptionId}`
-          : `${formDescriptionId} ${formMessageId}`
+          : ``
       }
       aria-invalid={!!error}

[Survived] BooleanLiteral
src/components/ui/form.tsx:119:22
           ? `${formDescriptionId}`
           : `${formDescriptionId} ${formMessageId}`
       }
-      aria-invalid={!!error}
+      aria-invalid={!error}
       {...props}
     />

[Survived] BlockStatement
src/components/ui/form.tsx:129:37
 const FormDescription = React.forwardRef<
   HTMLParagraphElement,
   React.HTMLAttributes<HTMLParagraphElement>
->(({ className, ...props }, ref) => {
-  const { formDescriptionId } = useFormField()
-
-  return (
-    <p
-      ref={ref}
-      id={formDescriptionId}
-      className={cn("text-sm text-muted-foreground", className)}
-      {...props}
-    />
-  )
-})
+>(({ className, ...props }, ref) => {})
 FormDescription.displayName = "FormDescription"
 

[Survived] StringLiteral
src/components/ui/form.tsx:141:31
     />
   )
 })
-FormDescription.displayName = "FormDescription"
+FormDescription.displayName = ""
 
 const FormMessage = React.forwardRef<

[Survived] BlockStatement
src/components/ui/form.tsx:146:47
 const FormMessage = React.forwardRef<
   HTMLParagraphElement,
   React.HTMLAttributes<HTMLParagraphElement>
->(({ className, children, ...props }, ref) => {
-  const { error, formMessageId } = useFormField()
-  const body = error ? String(error?.message) : children
-
-  if (!body) {
-    return null
-  }
-
-  return (
-    <p
-      ref={ref}
-      id={formMessageId}
-      className={cn("text-sm font-medium text-destructive", className)}
-      {...props}
-    >
-      {body}
-    </p>
-  )
-})
+>(({ className, children, ...props }, ref) => {})
 FormMessage.displayName = "FormMessage"
 

[NoCoverage] OptionalChaining
src/components/ui/form.tsx:148:31
   React.HTMLAttributes<HTMLParagraphElement>
 >(({ className, children, ...props }, ref) => {
   const { error, formMessageId } = useFormField()
-  const body = error ? String(error?.message) : children
+  const body = error ? String(error.message) : children
 
   if (!body) {

[Survived] ConditionalExpression
src/components/ui/form.tsx:150:7
   const { error, formMessageId } = useFormField()
   const body = error ? String(error?.message) : children
 
-  if (!body) {
+  if (false) {
     return null
   }

[NoCoverage] StringLiteral
src/components/ui/form.tsx:158:21
     <p
       ref={ref}
       id={formMessageId}
-      className={cn("text-sm font-medium text-destructive", className)}
+      className={cn("", className)}
       {...props}
     >
