[NoCoverage] ObjectLiteral
src/config/index.ts:4:30
 import z from 'zod';
 
 
-const environment = z.object({
-    NODE_ENV: z.enum(['development', 'test', 'production']),
-    URL_SHORTENER_API: z.string().url(),
-});
+const environment = z.object({});
 
 export type Environment = z.infer<typeof environment>;

[NoCoverage] ArrayDeclaration
src/config/index.ts:5:22
 
 
 const environment = z.object({
-    NODE_ENV: z.enum(['development', 'test', 'production']),
+    NODE_ENV: z.enum([]),
     URL_SHORTENER_API: z.string().url(),
 });

[NoCoverage] ConditionalExpression
src/config/index.ts:18:5
 
 const parsed = environment.safeParse(processEnv);
 
-if (!parsed.success) {
+if (false) {
     console.error(parsed.error.flatten().fieldErrors);
     throw new Error('Invalid environment variables');

[NoCoverage] BooleanLiteral
src/config/index.ts:18:5
 
 const parsed = environment.safeParse(processEnv);
 
-if (!parsed.success) {
+if (parsed.success) {
     console.error(parsed.error.flatten().fieldErrors);
     throw new Error('Invalid environment variables');

[NoCoverage] ObjectLiteral
src/config/index.ts:23:46
     throw new Error('Invalid environment variables');
 }
 
-export const config = new Proxy(parsed.data, {
-    get(target, prop) {
-        if (typeof prop !== 'string') {
-            return undefined;
-        }
-
-        return target[prop as keyof typeof target];
-    },
-});
+export const config = new Proxy(parsed.data, {});

[NoCoverage] BlockStatement
src/config/index.ts:24:23
 }
 
 export const config = new Proxy(parsed.data, {
-    get(target, prop) {
-        if (typeof prop !== 'string') {
-            return undefined;
-        }
-
-        return target[prop as keyof typeof target];
-    },
+    get(target, prop) {},
 });

[NoCoverage] EqualityOperator
src/config/index.ts:25:13
 
 export const config = new Proxy(parsed.data, {
     get(target, prop) {
-        if (typeof prop !== 'string') {
+        if (typeof prop === 'string') {
             return undefined;
         }

[NoCoverage] ConditionalExpression
src/config/index.ts:25:13
 
 export const config = new Proxy(parsed.data, {
     get(target, prop) {
-        if (typeof prop !== 'string') {
+        if (false) {
             return undefined;
         }
