[NoCoverage] BlockStatement
src/urls/useShortenUrl.tsx:3:55
 import {ShortenUrlService} from "@/urls/ShortenUrlService.ts";
 
-export const useShortenUrl = (): ShortenUrlService => {
-    const shortenUrl = (url: string) => {
-        throw new Error("not implemented");
-    };
-    return {
-        shortenUrl
-    };
-}
+export const useShortenUrl = (): ShortenUrlService => {}

[NoCoverage] BlockStatement
src/urls/useShortenUrl.tsx:4:41
 import {ShortenUrlService} from "@/urls/ShortenUrlService.ts";
 
 export const useShortenUrl = (): ShortenUrlService => {
-    const shortenUrl = (url: string) => {
-        throw new Error("not implemented");
-    };
+    const shortenUrl = (url: string) => {};
     return {
         shortenUrl

[NoCoverage] StringLiteral
src/urls/useShortenUrl.tsx:5:25
 
 export const useShortenUrl = (): ShortenUrlService => {
     const shortenUrl = (url: string) => {
-        throw new Error("not implemented");
+        throw new Error("");
     };
     return {

[NoCoverage] ObjectLiteral
src/urls/useShortenUrl.tsx:7:12
     const shortenUrl = (url: string) => {
         throw new Error("not implemented");
     };
-    return {
-        shortenUrl
-    };
+    return {};
 }
