[Survived] ObjectLiteral
src/components/ui/button.tsx:11:16
   {
     variants: {
-      variant: {
-        default: "bg-primary text-primary-foreground hover:bg-primary/90",
-        destructive:
-          "bg-destructive text-destructive-foreground hover:bg-destructive/90",
-        outline:
-          "border border-input bg-background hover:bg-accent hover:text-accent-foreground",
-        secondary:
-          "bg-secondary text-secondary-foreground hover:bg-secondary/80",
-        ghost: "hover:bg-accent hover:text-accent-foreground",
-        link: "text-primary underline-offset-4 hover:underline",
-      },
+      variant: {},
       size: {
         default: "h-10 px-4 py-2",

[Survived] StringLiteral
src/components/ui/button.tsx:16:11
         destructive:
           "bg-destructive text-destructive-foreground hover:bg-destructive/90",
         outline:
-          "border border-input bg-background hover:bg-accent hover:text-accent-foreground",
+          "",
         secondary:
           "bg-secondary text-secondary-foreground hover:bg-secondary/80",

[Survived] ObjectLiteral
src/components/ui/button.tsx:22:13
         ghost: "hover:bg-accent hover:text-accent-foreground",
         link: "text-primary underline-offset-4 hover:underline",
       },
-      size: {
-        default: "h-10 px-4 py-2",
-        sm: "h-9 rounded-md px-3",
-        lg: "h-11 rounded-md px-8",
-        icon: "h-10 w-10",
-      },
+      size: {},
     },
     defaultVariants: {

[Survived] StringLiteral
src/components/ui/button.tsx:24:13
       },
       size: {
         default: "h-10 px-4 py-2",
-        sm: "h-9 rounded-md px-3",
+        sm: "",
         lg: "h-11 rounded-md px-8",
         icon: "h-10 w-10",

[Killed] BlockStatement
src/components/ui/button.tsx:43:69
 }
 
 const Button = React.forwardRef<HTMLButtonElement, ButtonProps>(
-  ({ className, variant, size, asChild = false, ...props }, ref) => {
-    const Comp = asChild ? Slot : "button"
-    return (
-      <Comp
-        className={cn(buttonVariants({ variant, size, className }))}
-        ref={ref}
-        {...props}
-      />
-    )
-  }
+  ({ className, variant, size, asChild = false, ...props }, ref) => {}
 )
 Button.displayName = "Button"
killedBy: GuestShortenUrlForm should submit the form with the given URL
statusReason: Unable to find an accessible element with the role "button" and name `/shorten URL/i`

Here are the accessible roles:

  textbox:

  Name "URL to shorten":
  <input

[Killed] BooleanLiteral
src/components/ui/button.tsx:43:42
 }
 
 const Button = React.forwardRef<HTMLButtonElement, ButtonProps>(
-  ({ className, variant, size, asChild = false, ...props }, ref) => {
+  ({ className, variant, size, asChild = true, ...props }, ref) => {
     const Comp = asChild ? Slot : "button"
     return (
killedBy: GuestShortenUrlForm should submit the form with the given URL
statusReason: Unable to find an accessible element with the role "button" and name `/shorten URL/i`

Here are the accessible roles:

  textbox:

  Name "URL to shorten":
  <input

[Survived] ObjectLiteral
src/components/ui/button.tsx:47:38
     const Comp = asChild ? Slot : "button"
     return (
       <Comp
-        className={cn(buttonVariants({ variant, size, className }))}
+        className={cn(buttonVariants({}))}
         ref={ref}
         {...props}
