[Killed] ObjectLiteral
src/urls/GuestShortenUrlForm.tsx:17:35
 import {Button} from "@/components/ui/button.tsx";
 import {useShortenUrl} from "@/urls/useShortenUrl.tsx";
 
-const shortenUrlSchema = z.object({
-    url: z.string().url({
-        message: "Please enter a valid URL",
-    }),
-});
+const shortenUrlSchema = z.object({});
 
 export const GuestShortenUrlForm = () => {
killedBy: GuestShortenUrlForm should submit the form with the given URL
statusReason: expected "spy" to be called with arguments: [ 'https://www.example.com' ]

Received: 

  1st spy call:

  Array [
-   "https://www.example.com",

[Survived] ObjectLiteral
src/urls/GuestShortenUrlForm.tsx:18:25
 import {useShortenUrl} from "@/urls/useShortenUrl.tsx";
 
 const shortenUrlSchema = z.object({
-    url: z.string().url({
-        message: "Please enter a valid URL",
-    }),
+    url: z.string().url({}),
 });
 

[Survived] StringLiteral
src/urls/GuestShortenUrlForm.tsx:19:18
 
 const shortenUrlSchema = z.object({
     url: z.string().url({
-        message: "Please enter a valid URL",
+        message: "",
     }),
 });

[Killed] BlockStatement
src/urls/GuestShortenUrlForm.tsx:32:66
     })
     const {shortenUrl} = useShortenUrl();
 
-    const onSubmit = (data: z.infer<typeof shortenUrlSchema>) => {
-        shortenUrl(data.url);
-    }
+    const onSubmit = (data: z.infer<typeof shortenUrlSchema>) => {}
 
     return (
killedBy: GuestShortenUrlForm should submit the form with the given URL
statusReason: expected "spy" to be called with arguments: [ 'https://www.example.com' ]

Received: 



Number of calls: 0

[Killed] ArrowFunction
src/urls/GuestShortenUrlForm.tsx:42:29
                 <FormField
                     control={form.control}
                     name="url"
-                    render={({field}) => (
-                        <FormItem>
-                            <FormLabel>URL to shorten</FormLabel>
-                            <FormControl>
-                                <Input {...field} />
-                            </FormControl>
-                            <FormDescription>
-                                This is the URL you want to shorten.
-                            </FormDescription>
-                            <FormMessage/>
-                        </FormItem>
-                    )}
+                    render={() => undefined}
                 />
                 <Button type="submit">Shorten URL</Button>
killedBy: GuestShortenUrlForm should submit the form with the given URL
statusReason: Unable to find a label with the text of: /URL to shorten/i

Ignored nodes: comments, script, style
<body>
  <div>
    <form>
      <button
