[Killed] ArrowFunction
src/components/ui/label.tsx:15:3
   React.ElementRef<typeof LabelPrimitive.Root>,
   React.ComponentPropsWithoutRef<typeof LabelPrimitive.Root> &
     VariantProps<typeof labelVariants>
->(({ className, ...props }, ref) => (
-  <LabelPrimitive.Root
-    ref={ref}
-    className={cn(labelVariants(), className)}
-    {...props}
-  />
-))
+>(() => undefined)
 Label.displayName = LabelPrimitive.Root.displayName
 
killedBy: GuestShortenUrlForm should submit the form with the given URL
statusReason: Unable to find a label with the text of: /URL to shorten/i

Ignored nodes: comments, script, style
<body>
  <div>
    <form>
      <div
        class="space-y-2"
