[Killed] ConditionalExpression
src/components/ui/form.tsx:150:7
   const { error, formMessageId } = useFormField()
   const body = error ? String(error?.message) : children
 
-  if (!body) {
+  if (true) {
     return null
   }
killedBy: GuestShortenUrlForm should show message 'Please submit a valid URL' when given URL is invalid
statusReason: Unable to find an element with the text: Please enter a valid URL. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form>
      <div
        class="space-y-2"
